src/blogs/stairway-to-heaven.org
#+title: Stairway to Heaven

#+BEGIN_VERSE
There's a lady who's sure all that glitters is gold（有一位姑娘她相信闪光的都是金子）
And she's buying a stairway to heaven（她想买一架通往天堂的阶梯）
When she gets there she knows if the stores are all closed（她明白即使商店都已关门）
With a word she can get what she came for（只要轻启朱唇她就能得到所要的东西）
Ooh ooh and she's buying a stairway to heaven（她想买一架通往天堂的阶梯）

There's a sign on the wall but she wants to be sure（墙上分明有告示但她却想打听确实）
'Cause you know sometimes words have two meanings（因为你知道有些词一语双关）
In a tree by the brook there's a songbird who sings（在溪边的树上有只鸟儿在歌唱）
Sometimes all of our thoughts are misgiven（有时我们所有的想法都值得重新思量）
Ooh it makes me wonder（这使我迷茫）
Ooh it makes me wonder（这使我迷茫）

There's a feeling I get when I look to the west（眺望西方一种感觉油然而生）
And my spirit is crying for leaving（我的心灵哭喊着想要离去）
In my thoughts I have seen rings of smoke through the trees（我臆想树林中烟雾袅绕）
And the voices of those who standing looking（伴随着那些眺望者发出的呼喊）
Ooh it makes me wonder（这使我迷茫）
Ooh it really makes me wonder（这真的使我迷茫）

And it's whispered that soon（消息会被迅速地悄声传开）
If we all call the tune（如果我们也有掌调的机会）
Then the piper will lead us to reason（吹笛人会为我们指点迷津）
And a new day will dawn for those who stand long（新的一天为那些坚守许久的人们而破晓）
And the forests will echo with laughter（森林也答以带笑的回音）
Ooh

If there's a bustle in your hedgerow don't be alarmed now（别惊慌如果灌木中传来喧嚷）
It's just a spring clean for the May Queen（那只是为五月皇后而做的春季扫除）
Yes there are two paths you can go by（有两条路你可以选择）
But in the long run（然而长远点说）
There's still time to change the road you're on（你仍有机会改变现在的路）
And it makes me wonder（这使我迷茫）
Ooh

Your head is humming and it won't go（你脑袋嗡嗡作响经久不绝）
In case you don't know（因为你不知道）
The pipers calling you to join him（那是吹笛人邀你与他同行）
Dear lady can you hear the wind blow（亲爱的姑娘你能听见风起的声音吗）
And did you know（你可知道）
Your stairway lies on the whispering wind（你的天堂之梯就横亘在这飒飒风中）
Ooh

And as we wind on down the road（当我们沿路蜿蜒而去）
Our shadows taller than our soul（影子高过我们的灵魂）
There walks a lady we all know（一位我们熟悉的姑娘走来）
Who shines white light and wants to show（她闪烁着白光要我们知道）
How evrything still turns to gold（怎么把世间万物变成金子）
And if you listen very hard（如果你细心聆听）
The tune will come to you at last（你最终会听到那曲调）
When all are one and one is all yeah（当万物合一一即万物）
To be a rock and not to roll（你就会成为磐石岿然不动）
And she's buying a stairway to heaven（她想买一架通往天堂的阶梯）
#+END_VERSE
