blogs/stairway-to-heaven.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Stairway to Heaven</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="http://dirtysalt.info/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="../css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Stairway to Heaven</h1>
<p class="verse">
There's a lady who's sure all that glitters is gold（有一位姑娘她相信闪光的都是金子）<br  />
And she's buying a stairway to heaven（她想买一架通往天堂的阶梯）<br  />
When she gets there she knows if the stores are all closed（她明白即使商店都已关门）<br  />
With a word she can get what she came for（只要轻启朱唇她就能得到所要的东西）<br  />
Ooh ooh and she's buying a stairway to heaven（她想买一架通往天堂的阶梯）<br  />
<br  />
There's a sign on the wall but she wants to be sure（墙上分明有告示但她却想打听确实）<br  />
'Cause you know sometimes words have two meanings（因为你知道有些词一语双关）<br  />
In a tree by the brook there's a songbird who sings（在溪边的树上有只鸟儿在歌唱）<br  />
Sometimes all of our thoughts are misgiven（有时我们所有的想法都值得重新思量）<br  />
Ooh it makes me wonder（这使我迷茫）<br  />
Ooh it makes me wonder（这使我迷茫）<br  />
<br  />
There's a feeling I get when I look to the west（眺望西方一种感觉油然而生）<br  />
And my spirit is crying for leaving（我的心灵哭喊着想要离去）<br  />
In my thoughts I have seen rings of smoke through the trees（我臆想树林中烟雾袅绕）<br  />
And the voices of those who standing looking（伴随着那些眺望者发出的呼喊）<br  />
Ooh it makes me wonder（这使我迷茫）<br  />
Ooh it really makes me wonder（这真的使我迷茫）<br  />
<br  />
And it's whispered that soon（消息会被迅速地悄声传开）<br  />
If we all call the tune（如果我们也有掌调的机会）<br  />
Then the piper will lead us to reason（吹笛人会为我们指点迷津）<br  />
And a new day will dawn for those who stand long（新的一天为那些坚守许久的人们而破晓）<br  />
And the forests will echo with laughter（森林也答以带笑的回音）<br  />
Ooh<br  />
<br  />
If there's a bustle in your hedgerow don't be alarmed now（别惊慌如果灌木中传来喧嚷）<br  />
It's just a spring clean for the May Queen（那只是为五月皇后而做的春季扫除）<br  />
Yes there are two paths you can go by（有两条路你可以选择）<br  />
But in the long run（然而长远点说）<br  />
There's still time to change the road you're on（你仍有机会改变现在的路）<br  />
And it makes me wonder（这使我迷茫）<br  />
Ooh<br  />
<br  />
Your head is humming and it won't go（你脑袋嗡嗡作响经久不绝）<br  />
In case you don't know（因为你不知道）<br  />
The pipers calling you to join him（那是吹笛人邀你与他同行）<br  />
Dear lady can you hear the wind blow（亲爱的姑娘你能听见风起的声音吗）<br  />
And did you know（你可知道）<br  />
Your stairway lies on the whispering wind（你的天堂之梯就横亘在这飒飒风中）<br  />
Ooh<br  />
<br  />
And as we wind on down the road（当我们沿路蜿蜒而去）<br  />
Our shadows taller than our soul（影子高过我们的灵魂）<br  />
There walks a lady we all know（一位我们熟悉的姑娘走来）<br  />
Who shines white light and wants to show（她闪烁着白光要我们知道）<br  />
How evrything still turns to gold（怎么把世间万物变成金子）<br  />
And if you listen very hard（如果你细心聆听）<br  />
The tune will come to you at last（你最终会听到那曲调）<br  />
When all are one and one is all yeah（当万物合一一即万物）<br  />
To be a rock and not to roll（你就会成为磐石岿然不动）<br  />
And she's buying a stairway to heaven（她想买一架通往天堂的阶梯）<br  />
</p>
</div>
<!-- DISQUS BEGIN --><div id="disqus_thread"></div><script type="text/javascript">/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * *//* required: replace example with your forum shortname  */var disqus_shortname = 'dirlt';var disqus_identifier = 'blogs/stairway-to-heaven.html';var disqus_title = 'blogs/stairway-to-heaven.html';var disqus_url = 'http://dirtysalt.github.io/blogs/stairway-to-heaven.html';/* * * DON'T EDIT BELOW THIS LINE * * */(function() {var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);})();</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a><!-- DISQUS END --></body>
</html>
